/*""FILE COMMENT""*************************************************************
 * System Name  : S/R System
 * File Name    : f_lin_main.c
 * Contests     : 
 * Model        : SRF汎用
 * Order        : Project No 
 * CPU          : Renesas H8/300H Tiny Series
 * Compiler     : Renesas H8S,H8/300 Series C/C++ Compiler Ver 5.0.1
 * OS           : no used
 * Note         :
 ******************************************************************************
 *                                      Copyright(c) AISIN SEIKI CO.,LTD.
 ******************************************************************************
 * History      : 2003.11.28
 *""FILE COMMENT END""*********************************************************/

#pragma	section	lin

/******************************************************************************/
/* Header File Include 														  */
/******************************************************************************/
#include "l_slin_cmn.h"
#include "l_slin_def.h"
#include "l_slin_api.h"
#include "l_slin_tbl.h"
#include "l_slin_nmc.h"

#include "p_lin_apl.h"
#include "f_dev_inthdr_h8tiny.h"
#include "f_lin_main.h"
#include "f_diag_if.h"
#include "f_sys_fail.h"
#include "f_lin_if.h"
#include "f_sleep_ctl_srf.h"
#include "f_diag_main.h"
#include "p_piosw.h"
#include "p_piosw_ig.h"
#include "p_comdwn_tmr.h"
#include "p_mtr.h"
#include "f_lin_if.h"

#pragma interrupt ( f_vogi_inthdr_irq0 )
#pragma interrupt ( f_vogi_inthdr_tmr_z0 )
#pragma interrupt ( f_vogi_inthdr_sci3_2 )

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : Lin通信初期化処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : Lin Driver及びSCI2などの初期化を行う
 *-----------------------------------------------------------------------------
 * 引数            : u1 u1a_mode 
 *				   : U1G_FLB_TRUE  - RESET時に呼び出して初期化を行う
 *				   : U1G_FLB_FALSE - WakeUp時に呼び出して初期化を行う
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ システム初期化API関数 		l_sys_init() 
 *				   :		SCI2初期化関数 						f_vog_ini_sci3_2()
 *				   :		バッファ、ドライバの初期化API関数   l_ifc_init_**()
 *				   :		NM用 初期化API関数  				l_nm_init_**()
 *				   :		LIN通信接続API関数  				l_ifc_connect_**()
 *				   : 					** は、ﾃﾞﾊﾞｲｽに依存する
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.06.14
 *""FUNC COMMENT END""*********************************************************/
void  f_vog_lin_init( u1 u1a_mode )
{
	/* 同期フラグ : フレーム送信完了フラグクリア */
	F1g_lin_txframe_id23h = U1G_LIN_BIT_CLR;
	
	/* 同期フラグ : フレーム受信完了フラグクリア */
	F1g_lin_rxframe_id28h = U1G_LIN_BIT_CLR;
	F1g_lin_rxframe_id29h = U1G_LIN_BIT_CLR;
	F1g_lin_rxframe_id2bh = U1G_LIN_BIT_CLR;
	F1g_lin_rxframe_id2ah = U1G_LIN_BIT_CLR;
	F1g_lin_rxframe_id22h = U1G_LIN_BIT_CLR;

	/* 初回受信フラグの初期化(受信したらクリア) */
	/* --------ボディーECU情報①は、リセット時のみ初期化する ----------------- */ 
	if( U1G_FLB_TRUE == u1a_mode ) { 
	    F_id28_first = U1G_LIN_BIT_SET;		/* ボディーECU情報①初回受信初期化 */
	}
	else {
	}
    F_id29_first = U1G_LIN_BIT_SET;		/* ボディーECU情報②初回受信初期化		*/
    F_id2a_first = U1G_LIN_BIT_SET;		/* ボディーECU情報③初回受信初期化		*/
    F_id22_first = U1G_LIN_BIT_SET;		/* ボディーECU情報④初回受信初期化		*/
    F_id2b_first = U1G_LIN_BIT_SET;		/* P/WマスタSW情報初回受信初期化		*/

	F_comdwn_01 = U1G_LIN_BIT_CLR;		/* ボディーECU情報①途絶判定フラグクリア */
	F_comdwn_02 = U1G_LIN_BIT_CLR;		/* ボディーECU情報②途絶判定フラグクリア */
	F_comdwn_03 = U1G_LIN_BIT_CLR;		/* ボディーECU情報③途絶判定フラグクリア */
	F_comdwn_04 = U1G_LIN_BIT_CLR;		/* ボディーECU情報④途絶判定フラグクリア */
	F_comdwn_05 = U1G_LIN_BIT_CLR;		/* P/WマスタSW情報途絶判定フラグクリア	 */

	p_vog_tmr_start_id28_cmdwn();		/* ボディーECU情報①途絶判定タイマ初期化 */
	p_vog_tmr_start_id29_cmdwn();		/* ボディーECU情報②途絶判定タイマ初期化 */
	p_vog_tmr_start_id2a_cmdwn();		/* ボディーECU情報③途絶判定タイマ初期化 */
	p_vog_tmr_start_id22_cmdwn();		/* ボディーECU情報④途絶判定タイマ初期化 */
	p_vog_tmr_start_id2b_cmdwn();  		/* P/WマスタSW情報途絶判定タイマ初期化	 */

    if( U1G_LIN_OK != l_sys_init() ){       	/* システム初期化API */
        /* LIN通信システム初期化が出来なかった場合フェイルセーフ処理をおこなう */
		f_vog_set_fail_cpu();					/* ＣＰＵリセット処理 */
    }
	else {
	}
	
    l_ifc_init_ch1();                            /* バッファ、ドライバの初期化API */
    l_nm_init_ch1();                             /* NM用 初期化API */
	
	/* 送受信スロットはデフォルトで有効になっているため、必要があればここで無効をセットすること	*/
	l_slot_disable_ch1(U1G_LIN_FRAME_ID3DH); 	/* 送信フレームスロットを無効にする */
    
    if( U1G_LIN_OK != l_ifc_connect_ch1() ){     /* LIN通信接続API */
        /* LIN通信接続が出来なかった場合フェイルセーフ処理をおこなう */
		f_vog_set_fail_cpu();					 /* ＣＰＵリセット処理 */
    }
	else {
    }
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : Lin通信受信メイン処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : Lin通信の受信制御処理を行う
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : Sleep要因判定関数	f_u1l_ans_sleep_check() 
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.06.14
 *""FUNC COMMENT END""*********************************************************/
void  f_vog_lin_rcv_main(void)
{
	f_vog_get_lin_dat();					/* LIN受信データ取得処理	*/
	f_vog_get_diag_mode();					/* ダイアグモード取得処理		*/
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : Lin通信送信メイン処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : Lin通信の送信制御処理を行う
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : Sleep要因判定関数	f_u1l_ans_sleep_check() 
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.06.14
 *""FUNC COMMENT END""*********************************************************/
void  f_vog_lin_snd_main(void)
{
	f_vog_lin_warn_send();					/* ＬＩＮデータ送信処理		*/
	f_vog_diag_main();
	f_vog_diag_mng_rsps();					/* ダイアグ応答送信管理処理	*/
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : Lin通信制御メイン処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : Lin通信の送信制御処理を行う
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : Sleep要因判定関数	f_u1l_ans_sleep_check() 
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.06.14
 *""FUNC COMMENT END""*********************************************************/
void  f_vog_lin_mng_ctrl(void)
{
	l_u8   u1a_slp_req;			/* スリープ要因フラグ	*/
	xn_ref_mtr_t	xna_mtr_ref;

	p_vog_mtr_get_msg( &xna_mtr_ref );			/* モータ状態取得		*/
	/** スリープ禁止／ウェイクアップ要因の判定 **/
	if( U1G_FLB_TRUE == F1g_lin_p_bus_err_ch1 ){	/* フィジカル・バスエラー発生	*/
		F1g_lin_p_bus_err_ch1 = U1G_LIN_BIT_CLR;	/* エラー発生フラグクリア		*/
		u1a_slp_req = U1G_LIN_SLP_REQ_FORCE;		/* 強制スリープ要因有り 		*/
	} else {
#ifdef U1G_BUZZER_SELECT
		if(( U1G_FLB_TRUE == Fll_lin_srbz )  ||
			( U1G_FLB_TRUE == xna_mtr_ref.u1_flb_stat_mov )){
#else
		if( U1G_FLB_TRUE == xna_mtr_ref.u1_flb_stat_mov ){
#endif
			u1a_slp_req = U1G_LIN_SLP_REQ_OFF;		/* スリープ要求無し,又はウェイクアップ要因有り */
		}
		else {
			u1a_slp_req = U1G_LIN_SLP_REQ_ON;		/* スリープ要求有り,又はウェイクアップ要因無し */
		}
	}
	l_nm_tick_ch1(u1a_slp_req);				/* NM用Tick処理API			*/
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : 外部割り込み処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : Synch Break 検出及び Wake-up ﾊﾟﾙｽの検出
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ 外部INT(IRQ)関数 l_ifc_aux_**() 
 *		   		   : 				** は、ﾃﾞﾊﾞｲｽに依存する
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.06.14
 *""FUNC COMMENT END""*********************************************************/
void  f_vogi_inthdr_irq0(void)
{
    /* APIを呼び出す */
    l_ifc_aux_ch1();
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : ﾀｲﾏｰZ0処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : WAIT BIT の挿入及びﾍｯﾀﾞﾀｲﾑｱｳﾄ、ﾚｽﾎﾟﾝｽﾀｲﾑｱｳﾄの検出
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ ﾌﾚｰﾑﾀｲﾏ制御関数 l_ifc_tm_**() 
 *		   		   : 			** は、ﾃﾞﾊﾞｲｽに依存する
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.06.14
 *""FUNC COMMENT END""*********************************************************/
void  f_vogi_inthdr_tmr_z0(void)
{
    /* APIを呼び出す */
    l_ifc_tm_ch1();
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : SCI2受信割り込み処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : ﾃﾞｰﾀ一文字受信
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ ﾃﾞｰﾀ一文字受信関数 l_ifc_rx_**() 
 *		   		   : 			** は、ﾃﾞﾊﾞｲｽに依存する
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.06.17
 *""FUNC COMMENT END""*********************************************************/
void f_vogi_inthdr_sci3_2( void )
{
    /* APIを呼び出す */
    l_ifc_rx_ch1();
}

/***** End of File *****/




