/*""FILE COMMENT""*************************************************************
 * System Name  : S/R System
 * File Name    : f_lin_if.c
 * Contests     : 
 * Model        : SRF汎用
 * Order        : Project No 
 * CPU          : Renesas H8/300H Tiny Series
 * Compiler     : Renesas H8S,H8/300 Series C/C++ Compiler Ver 5.0.1
 * OS           : no used
 * Note         :
 ******************************************************************************
 *                                      Copyright(c) AISIN SEIKI CO.,LTD.
 ******************************************************************************
 * History      : 2003.11.28
 *""FILE COMMENT END""*********************************************************/

#pragma	section	lin

/******************************************************************************/
/* Header File Include 														  */
/******************************************************************************/
#include "l_slin_cmn.h"
#include "l_slin_def.h"
#include "l_slin_api.h"
#include "l_slin_tbl.h"
#include "l_slin_nmc.h"
#include "l_slin_drv_h83687.h"

#include "p_lin_apl.h"
#include "p_comdwn_tmr.h"

#include "f_lin_if.h"

/*============================================================*/
/*  構造体変数                                                */
/*============================================================*/
static xn_rx_dat_id28_t	xnl_rx_dat_id28;	/* ボディーＥＣＵ情報①受信データ */
static xn_rx_dat_id29_t	xnl_rx_dat_id29;	/* ボディーＥＣＵ情報②受信データ */
static xn_rx_dat_id2a_t	xnl_rx_dat_id2a;	/* ボディーＥＣＵ情報③受信データ */
static xn_rx_dat_id22_t	xnl_rx_dat_id22;	/* ボディーＥＣＵ情報④受信データ */
static xn_rx_dat_id2b_t	xnl_rx_dat_id2b;	/* Ｐ／ＷマスタＳＷ情報①データ取得処理 */

xn_tx_dat_id23_t	xng_tx_dat_id23;		/* Ｓ／Ｒ情報送信データ	*/
/*============================================================*/
/*  ローカル変数                                              */
/*============================================================*/
static u1  u1l_lin_flg;

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : LIN通信情報取得処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : 各ECUからの情報データを取り込む
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : ECU情報①取得処理			f_vog_ecu1st_get( void )
 *				   : ECU情報②取得処理			f_vog_ecu2nd_get( void )
 *				   : ECU情報③取得処理			f_vog_ecu3rd_get( void )
 *				   : ECU情報④取得処理			f_vog_ecu4th_get( void )
 *				   : P/WマスタSW情報①取得処理	f_vog_pwsw1st_get( void )
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.09.21
 *""FUNC COMMENT END""*********************************************************/ 
void  f_vog_get_lin_dat(void)
{
	f_vog_ecu1st_get();					/* ECU情報①取得処理			*/
	f_vog_ecu2nd_get();					/* ECU情報②取得処理			*/
	f_vog_ecu3rd_get();					/* ECU情報③取得処理			*/
	f_vog_ecu4th_get();					/* ECU情報④取得処理			*/
	f_vog_pwsw1st_get();				/* P/WマスタSW情報①取得処理	*/
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : ボディーECU情報①データ取得処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : ボディーECU情報①よりキー連動、ワイヤレス連動データ、
 * 				   : 通信IG信号、D席カーテシ信号を取り込む
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : スロットデータ一括読み込み(LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ関数)
 *				   :                l_slot_rd_ch1(l_frame_handle  u1a_lin_frm,
 *				   :						 l_u8 u1a_lin_cnt, l_u8 * pta_lin_data) 
 *				   : 通信途絶監視ﾀｲﾏ起動処理
 *				   :				p_vog_tmr_start_id28_cmdwn()
 *				   : 通信途絶判定処理
 *				   :				p_u1g_tmr_jdg_id28_cmdwn()
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.07.12
 *""FUNC COMMENT END""*********************************************************/ 
void  f_vog_ecu1st_get(void)
{
	u1 u1a_lin_sleep_ans;		/* LIN通信スリープ条件検査結果	*/

    /* ボディーECU情報①(ID=28h)の受信が完了していれば */
    if( U1G_LIN_BIT_SET == F1g_lin_rxframe_id28h ){
        /* ボディーECU情報①(ID=28h)の受信完了フラグ */
        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
        F1g_lin_rxframe_id28h = U1G_LIN_BIT_CLR;
        l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */

        /* ボディーECU情報①(ID=28h)のレスポンスエラーが発生した場合 */
        if( U1G_LIN_BYTE_CLR != F4g_lin_errframe_id28h ){
            /* ボディーECU情報①(ID=28h)のエラーフラグを クリアする */
	        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
            F4g_lin_errframe_id28h = U1G_LIN_BYTE_CLR;
	        l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */
        }
        else {	/* 受信が正常に完了したら	*/
	        /* 初回受信フラグ設定 1→0で受信受信済み */
	    	F_id28_first = U1G_LIN_BIT_CLR;	
            /* ボディーECU情報①(ID=28h)のレスポンスバッファからテンポラリバッファに読み出す */
			l_slot_rd_ch1(U1G_LIN_FRAME_ID28H, U1G_LIN_4,  xnl_rx_dat_id28.u1_rx_byte);
			F_comdwn_01 = U1G_LIN_BIT_CLR;		/* 途絶判定フラグクリア */
			p_vog_tmr_start_id28_cmdwn();		/* 途絶判定タイマ初期化	*/
            /* テンポラリバッファから読み出した値を、参照用構造体に格納 */
           	F_lin_ig	  = Fll_lin_ig;
#ifndef U1G_REAR_SW_SELECT
           	F_lin_pws     = Fll_lin_pws;
#endif
#ifdef U1G_BUZZER_SELECT
            F_lin_dcty	  = Fll_lin_dcty;
#endif
#ifdef U1G_REMOTE_SELECT
           	F_lin_kpwu    = Fll_lin_kpwu;
           	F_lin_kpwd    = Fll_lin_kpwd;
            F_lin_wpwu 	  = Fll_lin_wpwu;
            F_lin_wpwd	  = Fll_lin_wpwd;
            F_lin_spwu	  = Fll_lin_spwu;
#endif
			}
	} else {
	}
	u1a_lin_sleep_ans = l_nm_rd_slv_stat_ch1();			/* LINスリープ条件検査	*/

	if( U1G_LIN_SLVSTAT_SLEEP == u1a_lin_sleep_ans ){	/* Q. スリープ前提条件成立？	*/
		p_vog_tmr_start_id28_cmdwn();					/* 途絶判定タイマ初期化	*/
	}
	else {
		if( U1G_FLB_TRUE == p_u1g_tmr_jdg_id28_cmdwn() ){			/* 途絶してたら	*/
			F_comdwn_01  = U1G_LIN_BIT_SET;							/* 途絶判定フラグセット	*/
		    F_id28_first = U1G_LIN_BIT_SET;							/* ボディーECU情報①初回受信初期化 */
			/*---------- DCTYは不定として扱う ---------- */
			F_lin_ig	  = U1G_LIN_BIT_CLR;						/* IG = off(デフォルト)にセット		*/
#ifndef U1G_REAR_SW_SELECT
			F_lin_pws     = U1G_LIN_BIT_CLR;						/* PWS = off(デフォルト)にセット	*/
#endif
#ifdef U1G_REMOTE_SELECT
 			xng_lin_info_rmt.u1_lin_info_rmt = U1G_LIN_BYTE_CLR;	/* リモート信号デフォルト値設定*/
#endif
		} else {
		}
	}
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : ボディーECU情報②データ取得処
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : ボディーECU情報②より仕向データを取り込み仕向地を決定する
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : スロットデータ一括読み込み(LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ関数)
 *				   :                l_slot_rd_ch1(l_frame_handle  u1a_lin_frm,
 *				   :						 l_u8 u1a_lin_cnt, l_u8 * pta_lin_data) 
 *				   : 通信途絶監視ﾀｲﾏ起動処理
 *				   :				p_vog_tmr_start_id29_cmdwn()
 *				   : 通信途絶判定処理
 *				   :				p_u1g_tmr_jdg_id29_cmdwn()
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.07.12
 *""FUNC COMMENT END""*********************************************************/ 
void  f_vog_ecu2nd_get(void)
{
	u1	u1a_lin_cmt;

    /* ボディーECU情報②(ID=29h)の受信が完了していれば */
    if( U1G_LIN_BIT_SET == F1g_lin_rxframe_id29h ){
        /* ボディーECU情報②(ID=29h)の受信完了フラグをクリア */
        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
        F1g_lin_rxframe_id29h = U1G_LIN_BIT_CLR;
	    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */

        /* ボディーECU情報②(ID=29h)のレスポンスエラーが発生した場合 */
        if( U1G_LIN_BYTE_CLR != F4g_lin_errframe_id29h ){
            /* ボディーECU情報②(ID=29h)のエラーフラグを クリアする */
	        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
            F4g_lin_errframe_id29h = U1G_LIN_BYTE_CLR;
		    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */
        }
        else{	/* 受信が正常に完了したら	*/
		    /* 初回受信フラグ設定 1→0で受信受信済み */
	    	F_id29_first = U1G_LIN_BIT_CLR;	
            /* ボディーECU情報②(ID=29h)のレスポンスバッファからテンポラリバッファに読み出す */
			l_slot_rd_ch1(U1G_LIN_FRAME_ID29H, U1G_LIN_4,  xnl_rx_dat_id29.u1_rx_byte);
			F_comdwn_02 = U1G_LIN_BIT_CLR;		/* 途絶判定フラグクリア */
			p_vog_tmr_start_id29_cmdwn();		/* 途絶判定タイマ初期化	*/
            /* テンポラリバッファから読み出した値を、参照用構造体に格納 */
            U1g_lin_spd = U1l_lin_spd;
            u1a_lin_cmt = U1l_lin_cmt;
            
            /* 仕向を判断する */
            switch( (u2)u1a_lin_cmt ){
            	case(U1G_CMT_JPN):
            	case(U1G_CMT_EUR):
            	case(U1G_CMT_MNE):
            	case(U1G_CMT_CHN):
            	case(U1G_CMT_GEN):
            	case(U1G_CMT_AUS):
#ifndef U1G_REAR_SW_SELECT
					U1g_lin_cmt = U1G_DEST_JPN;
	           		break;
#endif
            	case(U1G_CMT_USA):
            	case(U1G_CMT_NON):
            	default:
               		U1g_lin_cmt = U1G_DEST_USA;
                	break;
            }
        }
    } else {
	}
	if( U1G_FLB_TRUE == p_u1g_tmr_jdg_id29_cmdwn() ){	/* 途絶してたら	*/
		F_comdwn_02  = U1G_LIN_BIT_SET;					/* 途絶判定フラグセット	*/
	    U1g_lin_spd = U1G_LIN_BYTE_CLR;					/* 車速デフォルト値設定 */
	} else {
	}
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : ボディーECU情報③データ取得処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : ボディーECU情報③の通信状態を検出し、データを取得する
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : スロットデータ一括読み込み(LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ関数)
 *				   :                l_slot_rd_ch1(l_frame_handle  u1a_lin_frm,
 *				   :						 l_u8 u1a_lin_cnt, l_u8 * pta_lin_data) 
 *				   : 通信途絶監視ﾀｲﾏ起動処理
 *				   :				p_vog_tmr_start_id2a_cmdwn()
 *				   : 通信途絶判定処理
 *				   :				p_u1g_tmr_jdg_id2a_cmdwn()
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.07.12
 *""FUNC COMMENT END""*********************************************************/ 
void  f_vog_ecu3rd_get(void)
{
    /* ボディーECU情報③(ID=2ah)の受信が完了していれば */
    if( U1G_FLB_TRUE == F1g_lin_rxframe_id2ah ){
        /* ボディーECU情報①(ID=2ah)の受信完了フラグをクリア */
        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
		F1g_lin_rxframe_id2ah = U1G_LIN_BIT_CLR;
	    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */

       /* フレームレスポンスエラーが発生した場合 */
        if( U1G_LIN_BYTE_CLR != F4g_lin_errframe_id2ah ){
            /* ボディーECU情報③(ID=2ah)のエラーフラグを クリアする */
	        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
            F4g_lin_errframe_id2ah = U1G_LIN_BYTE_CLR;
		    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */
        }
        else{	/* 受信が正常に完了したら	*/
	        /* 初回受信フラグ設定 1→0で受信受信済み */
	    	F_id2a_first = U1G_LIN_BIT_CLR;	
            /* ボディーECU情報③(ID=2ah)のレスポンスバッファからテンポラリバッファに読み出す */
			l_slot_rd_ch1(U1G_LIN_FRAME_ID2AH, U1G_LIN_4,  xnl_rx_dat_id2a.u1_rx_byte);
			F_comdwn_03 = U1G_LIN_BIT_CLR;		/* 途絶判定フラグクリア */
			p_vog_tmr_start_id2a_cmdwn(); 		/* 途絶判定タイマ初期化	*/
        }
	} else {
	}
	if( U1G_FLB_TRUE == p_u1g_tmr_jdg_id2a_cmdwn() ){	/* 途絶判定していたら	*/
		F_comdwn_03  = U1G_LIN_BIT_SET;					/* 途絶判定フラグセット	*/
	} else {
	}
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : ボディーECU情報④データ取得処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : ボディーECU情報④の通信状態を検出し、データを取得する
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : スロットデータ一括読み込み(LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ関数)
 *				   :                l_slot_rd_ch1(l_frame_handle  u1a_lin_frm,
 *				   :						 l_u8 u1a_lin_cnt, l_u8 * pta_lin_data) 
 *				   : 通信途絶監視ﾀｲﾏ起動処理
 *				   :				p_vog_tmr_start_id22_cmdwn()
 *				   : 通信途絶判定処理
 *				   :				p_u1g_tmr_jdg_id22_cmdwn()
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.07.12
 *""FUNC COMMENT END""*********************************************************/ 
void  f_vog_ecu4th_get(void)
{
    /* ボディーECU情報④(ID=22h)の受信が完了していれば */
    if( U1G_FLB_TRUE == F1g_lin_rxframe_id22h ){
        /* ボディーECU情報④(ID=22h)の受信完了フラグをクリア */
        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
        F1g_lin_rxframe_id22h = U1G_LIN_BIT_CLR;
	    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */

        /* フレームレスポンスエラーが発生した場合 */
        if( U1G_LIN_BYTE_CLR != F4g_lin_errframe_id22h ){
            /* ボディーECU情報④(ID=22h)のエラーフラグを クリアする */
	        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
            F4g_lin_errframe_id22h = U1G_LIN_BYTE_CLR;
		    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */
        }
        else{	/* 受信が正常に完了したら	*/
	        /* 初回受信フラグ設定 1→0で受信受信済み */
	    	F_id22_first = U1G_LIN_BIT_CLR;	
            /* ボディーECU情報④(ID=22h)のレスポンスバッファからテンポラリバッファに読み出す */
			l_slot_rd_ch1(U1G_LIN_FRAME_ID22H, U1G_LIN_4,  xnl_rx_dat_id22.u1_rx_byte);
			F_comdwn_04 = U1G_LIN_BIT_CLR;		/* 途絶判定フラグクリア */
			p_vog_tmr_start_id22_cmdwn(); 		/* 途絶判定タイマ初期化	*/
        }
	} else {
	}
	if( U1G_FLB_TRUE == p_u1g_tmr_jdg_id22_cmdwn() ){	/* 途絶判定していたら	*/
		F_comdwn_04  = U1G_LIN_BIT_SET;					/* 途絶判定フラグセット	*/
	} else {
	}
}

/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : Ｐ／ＷマスタＳＷ情報①データ取得処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : Ｐ／ＷマスタＳＷ①の通信状態を検出し、データを取得する
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : スロットデータ一括読み込み(LINｽﾚｰﾌﾞﾗｲﾌﾞﾗﾘ関数)
 *				   :                l_slot_rd_ch1(l_frame_handle  u1a_lin_frm,
 *				   :						 l_u8 u1a_lin_cnt, l_u8 * pta_lin_data) 
 *				   :				l_flg_clr()	bit clear
 *				   :				l_u8_rd()   1byte data read
 *				   : 通信途絶監視ﾀｲﾏ起動処理
 *				   :				p_vog_tmr_start_id2b_cmdwn()
 *				   : 通信途絶判定処理
 *				   :				p_u1g_tmr_jdg_id2b_cmdwn()
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.07.12
 *""FUNC COMMENT END""*********************************************************/ 
void  f_vog_pwsw1st_get(void)
{
    /* P/WマスタSW情報①(ID=2Bh)の受信が完了していれば */
    if( U1G_LIN_BIT_SET == F1g_lin_rxframe_id2bh ){
        /* P/WマスタSW情報①(ID=2Bh)の受信完了フラグをクリア */
        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
        F1g_lin_rxframe_id2bh  = U1G_LIN_BIT_CLR;
	    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */

        /* P/WマスタSW情報①(ID=2Bh)のレスポンスエラーが発生した場合 */
        if( U1G_LIN_BYTE_CLR != F4g_lin_errframe_id2bh ){
            /* P/WマスタSW情報①(ID=2Bh)のエラーフラグを クリアする */
	        u1l_lin_flg = l_u1g_lin_irq_dis();         /* 割り込み禁止設定 */
            F4g_lin_errframe_id2bh = U1G_LIN_BYTE_CLR;
		    l_vog_lin_irq_res( u1l_lin_flg );          /* 割り込み設定復元 */
        }
        else{	/* 受信が正常に完了したら	*/
    	    /* 初回受信フラグ設定 1→0で受信受信済み */
	    	F_id2b_first = U1G_LIN_BIT_CLR;	
            /* P/WマスタSW情報①(ID=2Bh)のレスポンスバッファからテンポラリバッファに読み出す */
			l_slot_rd_ch1(U1G_LIN_FRAME_ID2BH, U1G_LIN_4,  xnl_rx_dat_id2b.u1_rx_byte);
			F_comdwn_05  = U1G_LIN_BIT_CLR;		/* 途絶判定フラグクリア */
			p_vog_tmr_start_id2b_cmdwn();  		/* 途絶判定タイマ初期化	*/
            /* テンポラリバッファから読み出した値を、参照用構造体に格納 */
#ifdef U1G_REAR_SW_SELECT
           	F_lin_wl = Fll_lin_wl;				/* ウインドロック信号取得 */
#endif
        }
	} else {
		if( U1G_FLB_TRUE == p_u1g_tmr_jdg_id2b_cmdwn() ){	/* 途絶してたら	*/
			F_comdwn_05  = U1G_FLB_TRUE;                 	/* 途絶判定フラグセット	*/
#ifdef U1G_REAR_SW_SELECT
           	F_lin_wl = U1G_LIN_BIT_CLR;				/* ウインドロック信号デフォルト値設定 */
#endif
		} else {
		}
	}
}


/*""FUNC COMMENT""*************************************************************
 * ID              :
 * モジュール概要  : ワーニング出力確定処理
 *-----------------------------------------------------------------------------
 * 宣言            : 
 *-----------------------------------------------------------------------------
 * 機能            : 閉じ忘れ情報をLIN通信により出力する
 * 				   : 
 *-----------------------------------------------------------------------------
 * 引数            : -
 *-----------------------------------------------------------------------------
 * 戻り値          : -
 *-----------------------------------------------------------------------------
 * 入力            : -
 * 出力            : -
 *-----------------------------------------------------------------------------
 * 使用関数        : 警告情報取得   p_vog_caution_get_msg()
 *-----------------------------------------------------------------------------
 * 注意事項        : -
 *-----------------------------------------------------------------------------
 * History         : 2004.07.22
 *""FUNC COMMENT END""*********************************************************/ 
void  f_vog_lin_warn_send(void)
{
#ifdef U1G_BUZZER_SELECT
	u1	u1a_warning_stat = p_u1g_warning_get_out_stat();
	
	/* スライド/チルト警告灯 点灯要求判定	*/
	if( U1G_FLB_TRUE == u1a_warning_stat ){
		Fll_lin_srbz = U1G_LIN_BIT_SET;
	} else {
		Fll_lin_srbz = U1G_LIN_BIT_CLR;
	}
#endif
	l_slot_wr_ch1(U1G_LIN_FRAME_ID23H, U1G_LIN_4, xng_tx_dat_id23.u1_tx_byte);
}

/***** End of File *****/




